ERRORS = {
    # =========================
    # 600 – грешки на банката на наредителя
    # =========================
    601: "Недостатъчна наличност в сметката на наредителя.",
    602: "Банката наредител не може да се върже към банковия регистър.",
    603: "Не сте нито наредител, нито бенефициент. Може би има грешка.",
    604: "Надвишавате си лимита за еднократно плащане.",
    605: "Невалидна валута.",
    606: "Липсващи данни.",
    607: "Наредителят и получателят трябва да бъдат различни.",
    608: "Невалиден IBAN.",
    609: "Невалидна сметка на наредителя.",

    # =========================
    # 650 – грешки от банката бенефициент
    # =========================
    651: "Банката наредител не може да се свърже с банката бенефициент.",
    652: "Невалидна сметка на бенефициента.",

    # =========================
    # 700 – грешки от банковия регистър
    # =========================
    701: "Неразпозната банка на бенефициента."
}

def is_valid_iban(iban: str) -> bool:
    return bool(iban) and len(iban.strip()) <= 22 and iban.isalnum() and iban[:3].isalpha()

def error_response(code):
    return {
        "status_code": code,
        "status_msg": ERRORS.get(code, "Неразпознат код за грешка.")
    }
